In [1]:
# =[Préliminaires]==========================
# Usage de SQL magic commands avec ipython.

# Chargement de l'environnement informatique interactif ipython:
%load_ext sql

# Connection à la base de donnée mysql en tant que utilisateur
# 'kodascii' sur un 'localhost' avec pour mot de passe 'pass123':
%sql mysql://kodascii:pass123@localhost/

In [2]:
# Marque floody_1 comme base de donnée de travail:
%sql USE `playground`;

 * mysql://kodascii:***@localhost/
0 rows affected.

[]

In [3]:
%%sql
CREATE TABLE employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(255),
    dept_id INT
);

CREATE TABLE departments (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(255)
);

-- Insert sample data
INSERT INTO employees VALUES (1, 'John Doe', 101);
INSERT INTO employees VALUES (2, 'Jane Smith', 102);
INSERT INTO employees VALUES (3, 'Bob Johnson', 101);

INSERT INTO departments VALUES (101, 'HR');
INSERT INTO departments VALUES (102, 'IT');

 * mysql://kodascii:***@localhost/
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
SELECT *
FROM employees
INNER JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [8]:
%%sql
SELECT *
FROM employees
LEFT JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [9]:
%%sql
SELECT *
FROM employees
RIGHT JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]

In [13]:
%%sql
SELECT *
FROM employees
JOIN departments ON employees.dept_id = departments.dept_id;

 * mysql://kodascii:***@localhost/
3 rows affected.

[(1, 'John Doe', 101, 101, 'HR'),
 (2, 'Jane Smith', 102, 102, 'IT'),
 (3, 'Bob Johnson', 101, 101, 'HR')]